# Projeto de Bases de Dados - Parte 3

### Docente Responsável

Prof. Flávio Martins

### Grupo 25 <<<<<<<<<<<< COLOCAR HORAS
<dl>
    <dt>HH horas (33.3%)</dt>
    <dd>ist1103540 Gonçalo Alves</dd>
    <dt>HH horas (33.3%)</dt>
    <dd>ist1102908 Luana Ferraz</dd>
    <dt>HH horas (33.3%)</dt>
    <dd>ist1103555 Ricardo Pereira</dd>
<dl>

In [1]:
%config SqlMagic.displaylimit = None
%load_ext sql
%sql postgresql://db:db@postgres/db

displaylimit: Value None will be treated as 0 (no limit)

# Empresa de comércio online

## 0. Carregamento da Base de Dados

Carregue o esquema de Base de Dados apresentado no Anexo A.

In [2]:
%%sql

DROP TABLE IF EXISTS customer CASCADE;
DROP TABLE IF EXISTS orders CASCADE;
DROP TABLE IF EXISTS pay CASCADE;
DROP TABLE IF EXISTS employee CASCADE;
DROP TABLE IF EXISTS process CASCADE;
DROP TABLE IF EXISTS department CASCADE;
DROP TABLE IF EXISTS workplace CASCADE;
DROP TABLE IF EXISTS works CASCADE;
DROP TABLE IF EXISTS office CASCADE;
DROP TABLE IF EXISTS warehouse CASCADE;
DROP TABLE IF EXISTS product CASCADE;
DROP TABLE IF EXISTS contains CASCADE;
DROP TABLE IF EXISTS supplier CASCADE;
DROP TABLE IF EXISTS delivery CASCADE;

CREATE TABLE customer(
cust_no INTEGER PRIMARY KEY,
name VARCHAR(80) NOT NULL,
email VARCHAR(254) UNIQUE NOT NULL,
phone VARCHAR(15),
address VARCHAR(255)
);

CREATE TABLE orders(
order_no INTEGER PRIMARY KEY,
cust_no INTEGER NOT NULL REFERENCES customer,
date DATE NOT NULL
--order_no must exist in contains
);

CREATE TABLE pay(
order_no INTEGER PRIMARY KEY REFERENCES orders,
cust_no INTEGER NOT NULL REFERENCES customer
);

CREATE TABLE employee(
ssn VARCHAR(20) PRIMARY KEY,
TIN VARCHAR(20) UNIQUE NOT NULL,
bdate DATE,
name VARCHAR NOT NULL
--age must be >=18
);

CREATE TABLE process(
ssn VARCHAR(20) REFERENCES employee,
order_no INTEGER REFERENCES orders,
PRIMARY KEY (ssn, order_no)
);

CREATE TABLE department(
name VARCHAR PRIMARY KEY
);

CREATE TABLE workplace(
address VARCHAR PRIMARY KEY,
lat NUMERIC(8, 6) NOT NULL,
long NUMERIC(9, 6) NOT NULL,
UNIQUE(lat, long)
--address must be in warehouse or office but not both
);

CREATE TABLE office(
address VARCHAR(255) PRIMARY KEY REFERENCES workplace
);

CREATE TABLE warehouse(
address VARCHAR(255) PRIMARY KEY REFERENCES workplace
);

CREATE TABLE works(
ssn VARCHAR(20) REFERENCES employee,
name VARCHAR(200) REFERENCES department,
address VARCHAR(255) REFERENCES workplace,
PRIMARY KEY (ssn, name, address)
);

CREATE TABLE product(
SKU VARCHAR(25) PRIMARY KEY,
name VARCHAR(200) NOT NULL,
description VARCHAR,
price NUMERIC(10, 2) NOT NULL,
ean NUMERIC(13) UNIQUE
);

CREATE TABLE contains(
order_no INTEGER REFERENCES orders,
SKU VARCHAR(25) REFERENCES product,
qty INTEGER,
PRIMARY KEY (order_no, SKU)
);

CREATE TABLE supplier(
TIN VARCHAR(20) PRIMARY KEY,
name VARCHAR(200),
address VARCHAR(255),
SKU VARCHAR(25) REFERENCES product,
date DATE
);

CREATE TABLE delivery(
address VARCHAR(255) REFERENCES warehouse,
TIN VARCHAR(20) REFERENCES supplier,
PRIMARY KEY (address, TIN)
);

Running query in 'postgresql://db:***@postgres/db'

Crie as instruções para o seu preenchimento de forma consistente, garantindo que todas as consultas SQL e OLAP, apresentadas mais adiante, produzam um resultado não vazio.

In [3]:
%%sql
-- populate.sql
INSERT INTO customer VALUES (1234, 'John', 'john@email.com', 919191919, 'Rua Vasco Paisana n10 1234-567 Lisboa');
INSERT INTO customer VALUES (1235, 'Mary', 'mary@email.com', 919191555, 'Rua Vasco da Gama n18 1234-453 Lisboa');
INSERT INTO customer VALUES (1236, 'Paul', 'paul@email.com', 919191444, 'Rua Santa Maria n79 1234-873 Lisboa');
INSERT INTO customer VALUES (1237, 'Emily', 'emily@email.com', 919191333, 'Avenida 2 de agosto n46 4253-102 Coimbra');

INSERT INTO orders VALUES (0000, 1236, '2022-12-09');
INSERT INTO orders VALUES (1111, 1234, '2023-01-20');
INSERT INTO orders VALUES (2222, 1235, '2023-01-15');
INSERT INTO orders VALUES (3333, 1234, '2023-01-26');
INSERT INTO orders VALUES (4444, 1237, '2022-01-09');
INSERT INTO orders VALUES (5555, 1237, '2022-06-08');

INSERT INTO pay VALUES (1111, 1234);
INSERT INTO pay VALUES (4444, 1237);

INSERT INTO product VALUES ('12345678', 'box', '5cm/7cm/12cm, wooden box', 15.0, 5601234567890);
INSERT INTO product VALUES ('12345679', 'pen', 'black ink pen', 37.0, 5601234567800);
INSERT INTO product VALUES ('12345670', 'mirror', '170cm/230cm/5cm silver mirror', 58.0, 5601234567810);
INSERT INTO product VALUES ('12345671', 'sofa', '2-seat sofa, Vissle beige', 199.0, 5601234567820);
INSERT INTO product VALUES ('12345672', 'table', 'table, black, 110x67cm', 50.0, 5601234567830);

INSERT INTO contains VALUES (1111, '12345678', 2);
INSERT INTO contains VALUES (1111, '12345670', 1);
INSERT INTO contains VALUES (2222, '12345670', 1);
INSERT INTO contains VALUES (2222, '12345671', 2);
INSERT INTO contains VALUES (2222, '12345672', 1);
INSERT INTO contains VALUES (3333, '12345679', 10);
INSERT INTO contains VALUES (3333, '12345678', 3);
INSERT INTO contains VALUES (0000, '12345670', 3);
INSERT INTO contains VALUES (4444, '12345672', 2);

INSERT INTO employee VALUES ('12131415161', '258258258', '1997-04-26', 'Jane Doe');
INSERT INTO employee VALUES ('12131415162', '258258321', '1990-07-21', 'Mark Cliff');
INSERT INTO employee VALUES ('12131415163', '258258456', '1998-06-26', 'Tom Fizz');
INSERT INTO employee VALUES ('12131415164', '258258789', '1995-10-12', 'Catherine Stuart');
INSERT INTO employee VALUES ('12131415165', '258258987', '1999-11-04', 'Maggie Green');

INSERT INTO process VALUES ('12131415161', 0000);
INSERT INTO process VALUES ('12131415162', 1111);
INSERT INTO process VALUES ('12131415163', 2222);
INSERT INTO process VALUES ('12131415161', 3333);
INSERT INTO process VALUES ('12131415164', 4444);
INSERT INTO process VALUES ('12131415164', 5555);

INSERT INTO department VALUES ('Departamento de Gestao de Encomendas');
INSERT INTO department VALUES ('Departamento de Recursos Humanos');

INSERT INTO workplace VALUES ('Estrada da Avessada n24 2358-630 Oliveira de Azeméis', 38.927682, -9.257470);
INSERT INTO workplace VALUES ('Avenida da Republica n10 1000-203 Lisboa', 38.735465, -9.145027);
INSERT INTO workplace VALUES ('Pacifico n68 2495-471 Fátima', 38.729919, -9.073064);

INSERT INTO works VALUES ('12131415161', 'Departamento de Gestao de Encomendas', 'Estrada da Avessada n24 2358-630 Oliveira de Azeméis');
INSERT INTO works VALUES ('12131415162', 'Departamento de Gestao de Encomendas', 'Estrada da Avessada n24 2358-630 Oliveira de Azeméis');
INSERT INTO works VALUES ('12131415163', 'Departamento de Gestao de Encomendas', 'Avenida da Republica n10 1000-203 Lisboa');
INSERT INTO works VALUES ('12131415161', 'Departamento de Gestao de Encomendas', 'Pacifico n68 2495-471 Fátima');
INSERT INTO works VALUES ('12131415164', 'Departamento de Gestao de Encomendas', 'Avenida da Republica n10 1000-203 Lisboa');
INSERT INTO works VALUES ('12131415165', 'Departamento de Gestao de Encomendas', 'Estrada da Avessada n24 2358-630 Oliveira de Azeméis');

INSERT INTO warehouse VALUES ('Avenida da Republica n10 1000-203 Lisboa');
INSERT INTO warehouse VALUES ('Estrada da Avessada n24 2358-630 Oliveira de Azeméis');

INSERT INTO office VALUES ('Estrada da Avessada n24 2358-630 Oliveira de Azeméis');
INSERT INTO office VALUES ('Pacifico n68 2495-471 Fátima');

INSERT INTO supplier VALUES ('264893401', 'Wooden Space', 'Rua 30 de Fevereiro n7 5699-112 Arcos de Valdevez', '12345678', '2021-09-01');
INSERT INTO supplier VALUES ('268970012', 'BIC', 'Zona Industrial da Venda do Pinheiro n2a 2560-215 Venda do Pinheiro', '12345679', '2022-06-01');
INSERT INTO supplier VALUES ('264108994', 'Unividros', '3356-526 Ponte do Rol', '12345670', '2023-02-01');
INSERT INTO supplier VALUES ('263329855', 'IKEA', 'Zona Industrial de Alfragide n124 4579-545 Alfragide', '12345671', '2016-01-01');
INSERT INTO supplier VALUES ('265977103', 'Movixira Portugal', 'Alverca do Ribatejo n8 4569-200 Arrentela', '12345672', '2021-07-01');

INSERT INTO delivery VALUES ('Estrada da Avessada n24 2358-630 Oliveira de Azeméis', '264893401');
INSERT INTO delivery VALUES ('Estrada da Avessada n24 2358-630 Oliveira de Azeméis', '268970012');
INSERT INTO delivery VALUES ('Avenida da Republica n10 1000-203 Lisboa', '264108994');
INSERT INTO delivery VALUES ('Avenida da Republica n10 1000-203 Lisboa', '263329855');
INSERT INTO delivery VALUES ('Avenida da Republica n10 1000-203 Lisboa', '265977103');

Running query in 'postgresql://db:***@postgres/db'

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

## 1. Restrições de Integridade

Apresente o código para implementar as seguintes restrições de integridade, se necessário, com recurso a extensões procedimentais SQL (Stored Procedures e Triggers):

(RI-1) Nenhum empregado pode ter menos de 18 anos de idade

In [ ]:
%%sql
CREATE OR REPLACE FUNCTION younger_than_18() RETURNS TRIGGER AS $$
    BEGIN
        IF EXTRACT(YEAR FROM AGE(NEW.bdate)) < 18 THEN
            RAISE EXCEPTION 'Employee % must be at least 18 years old.', NEW.name;
        END IF;
        RETURN NEW;
    END;
$$
LANGUAGE plpgsql;

DROP TRIGGER IF EXISTS younger_than_18_trigger ON employee;
CREATE CONSTRAINT TRIGGER younger_than_18_trigger AFTER INSERT ON employee DEFERRABLE INITIALLY DEFERRED
    FOR EACH ROW EXECUTE FUNCTION younger_than_18();

:

(RI-2) Um 'Workplace' é obrigatoriamente um 'Office' ou 'Warehouse' mas não pode ser ambos

In [ ]:
%%sql
-- (RI-2)

(RI-3) Uma 'Order' tem de figurar obrigatoriamente em 'Contains'.

In [ ]:
%%sql
-- (RI-3)
CREATE OR REPLACE FUNCTION order_in_contains() RETURNS TRIGGER AS $$
    BEGIN
        IF NEW.order_no NOT IN (SELECT order_no FROM contains) THEN
            RAISE EXCEPTION 'Order number % is not referenced in relation Contains.', NEW.order_no;
        END IF;
        RETURN NEW;
    END;
$$
LANGUAGE plpgsql;

DROP TRIGGER IF EXISTS order_in_contains_trigger ON orders;
CREATE CONSTRAINT TRIGGER order_in_contains_trigger AFTER INSERT OR UPDATE ON orders DEFERRABLE INITIALLY DEFERRED
    FOR EACH ROW EXECUTE FUNCTION order_in_contains();

Running query in 'postgresql://db:***@postgres/db'

## 2. Consultas SQL

Apresente a consulta SQL mais sucinta para cada uma das seguintes questões

1) Qual o número e nome do(s) cliente(s) com maior valor total de encomendas pagas?

In [4]:
%%sql
SELECT name, cust_no
FROM customer JOIN pay USING (cust_no)
GROUP BY cust_no HAVING COUNT(DISTINCT pay.order_no) >= ALL
    (SELECT COUNT(DISTINCT pay.order_no)
    FROM customer JOIN pay USING (cust_no)
    GROUP BY cust_no);

Running query in 'postgresql://db:***@postgres/db'

2 rows affected.

+-------+---------+
|  name | cust_no |
+-------+---------+
|  John |   1234  |
| Emily |   1237  |
+-------+---------+

2. Qual o nome dos empregados que processaram encomendas em todos os dias de 2022 em que houve encomendas?

In [38]:
%%sql

SELECT name FROM employee e WHERE NOT EXISTS (
    SELECT date FROM orders WHERE EXTRACT(YEAR FROM date)=2022
    EXCEPT
    SELECT date FROM orders JOIN process p USING (order_no)
    WHERE e.ssn = p.ssn
);

Running query in 'postgresql://db:***@postgres/db'

+------+
| name |
+------+
+------+

3. Quantas encomendas foram realizadas mas não pagas em cada mês de 2022?

In [39]:
%%sql

SELECT EXTRACT(MONTH FROM date) AS month, COUNT(DISTINCT order_no) AS num_orders
FROM orders
WHERE order_no NOT IN (SELECT order_no FROM pay)
GROUP BY EXTRACT(YEAR FROM date), EXTRACT(MONTH FROM date) HAVING EXTRACT(YEAR FROM date)=2022;

Running query in 'postgresql://db:***@postgres/db'

2 rows affected.

+-------+------------+
| month | num_orders |
+-------+------------+
|   6   |     1      |
|   12  |     1      |
+-------+------------+

## 3. Vistas

Crie uma vista que resuma as informações mais importantes sobre as vendas de produtos, combinando informações de diferentes tabelas do esquema de base de dados. A vista deve ter o seguinte esquema:

product_sales(sku, order_no, qty, total_price, year, month, day_of_month, day_of_week, city)

In [4]:
%%sql
CREATE OR REPLACE VIEW product_sales AS
    SELECT 
        sku, order_no , qty, price * qty AS total_price, EXTRACT(YEAR FROM date) AS year, 
        EXTRACT(MONTH FROM date) AS month, EXTRACT(DAY FROM date) AS day_of_month, EXTRACT(DOW FROM date) AS day_of_week,
        SUBSTRING(address FROM '\d{4}-\d{3}\s(.+)') AS city
    FROM
        product JOIN contains USING (sku) JOIN orders USING(order_no) JOIN customer USING (cust_no);

*  postgresql://db:***@postgres/db
Done.

[]

In [5]:
%%sql
-- Retirar isto, não faz parte do relatório, é só para testar
SELECT * FROM product_sales;

*  postgresql://db:***@postgres/db
9 rows affected.

[('12345678', 1111, 2, Decimal('30.00'), Decimal('2023'), Decimal('1'), Decimal('20'), Decimal('5'), 'Lisboa'),
 ('12345670', 1111, 1, Decimal('58.00'), Decimal('2023'), Decimal('1'), Decimal('20'), Decimal('5'), 'Lisboa'),
 ('12345670', 2222, 1, Decimal('58.00'), Decimal('2023'), Decimal('1'), Decimal('15'), Decimal('0'), 'Lisboa'),
 ('12345671', 2222, 2, Decimal('398.00'), Decimal('2023'), Decimal('1'), Decimal('15'), Decimal('0'), 'Lisboa'),
 ('12345672', 2222, 1, Decimal('50.00'), Decimal('2023'), Decimal('1'), Decimal('15'), Decimal('0'), 'Lisboa'),
 ('12345679', 3333, 10, Decimal('370.00'), Decimal('2023'), Decimal('1'), Decimal('26'), Decimal('4'), 'Lisboa'),
 ('12345678', 3333, 3, Decimal('45.00'), Decimal('2023'), Decimal('1'), Decimal('26'), Decimal('4'), 'Lisboa'),
 ('12345670', 0, 3, Decimal('174.00'), Decimal('2022'), Decimal('12'), Decimal('9'), Decimal('5'), 'Lisboa'),
 ('12345672', 4444, 2, Decimal('100.00'), Decimal('2022'), Decimal('1'), Decimal('9'), Decimal('0'), 'Coimbra')]

## 4. Desenvolvimento de Aplicação

### Explicação da arquitetura da aplicação web, incluindo um link para uma versão de trabalho e as relações entre os vários ficheiros na pasta web/arquivos

...

## 5. Consultas OLAP

Usando a vista desenvolvida para a Questão 3, escreva duas consultas SQL que permitam analisar:

1. As quantidade e valores totais de venda de cada produto em 2022, globalmente, por cidade, por mês, dia do mês e dia da semana

In [25]:
%%sql

--TODO: Adicionar mais orders para ter uma tabela com mais entradas

SELECT sku, city, month, day_of_month, day_of_week, SUM(qty) as qty_sold, SUM(total_price) as sales
FROM product_sales
WHERE year = 2022
GROUP BY sku, ROLLUP(city, month, day_of_month, day_of_week)
ORDER BY sku, city, month, day_of_month, day_of_week ASC;

*  postgresql://db:***@postgres/db
10 rows affected.

[('12345670', 'Lisboa', Decimal('12'), Decimal('9'), Decimal('5'), 3, Decimal('174.00')),
 ('12345670', 'Lisboa', Decimal('12'), Decimal('9'), None, 3, Decimal('174.00')),
 ('12345670', 'Lisboa', Decimal('12'), None, None, 3, Decimal('174.00')),
 ('12345670', 'Lisboa', None, None, None, 3, Decimal('174.00')),
 ('12345670', None, None, None, None, 3, Decimal('174.00')),
 ('12345672', 'Coimbra', Decimal('1'), Decimal('9'), Decimal('0'), 2, Decimal('100.00')),
 ('12345672', 'Coimbra', Decimal('1'), Decimal('9'), None, 2, Decimal('100.00')),
 ('12345672', 'Coimbra', Decimal('1'), None, None, 2, Decimal('100.00')),
 ('12345672', 'Coimbra', None, None, None, 2, Decimal('100.00')),
 ('12345672', None, None, None, None, 2, Decimal('100.00'))]

2. O valor médio diário das vendas de todos os produtos em 2022, globalmente, por mês e dia da semana

In [27]:
%%sql

--TODO: Adicionar mais orders para ter uma tabela com mais entradas

SELECT month, day_of_week, AVG(total_price) as total_sales
FROM product_sales
WHERE year = 2022
GROUP BY ROLLUP(month, day_of_week)
ORDER BY month, day_of_week ASC;

*  postgresql://db:***@postgres/db
5 rows affected.

[(Decimal('1'), Decimal('0'), Decimal('100.0000000000000000')),
 (Decimal('1'), None, Decimal('100.0000000000000000')),
 (Decimal('12'), Decimal('5'), Decimal('174.0000000000000000')),
 (Decimal('12'), None, Decimal('174.0000000000000000')),
 (None, None, Decimal('137.0000000000000000'))]

## 6. Índices

Indique, com a devida justificação, que tipo de índice(s), sobre qual(is) atributo(s) e sobre qual(is) tabela(s) faria sentido criar, de forma a agilizar a execução de cada uma das seguintes consultas:

### 6.1
SELECT order_no
FROM orders 
JOIN contains USING (order_no) 
JOIN product USING (SKU) 
WHERE price > 50 AND 
EXTRACT(YEAR FROM date) = 2023

### Tipo de Índice, Atributos & Justificação

...

### 6.2
SELECT order_no, SUM(qty*price)
FROM contains 
JOIN product USING (SKU) 
WHERE name LIKE ‘A%’ 
GROUP BY order_no;

### Tipo de Índice, Atributos & Justificação

...